Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P30B.tmx
Source language: en_us
Languages: zh_cn

source: Going for a Beer
zh_cn: 去喝杯啤酒

source: He finds himself sitting in the neighborhood bar drinking a beer at about the same time that he began to think about going there for one.
zh_cn: 他打算去社区酒吧喝杯啤酒，几乎与此同时，他发现自己坐在酒吧里喝着啤酒。

source: In fact, he has finished it.
zh_cn: 其实，他已经喝完了那杯啤酒。

source: Perhaps he'll have a second one, he thinks, as he downs it and asks for a third.
zh_cn: 或许他还要再来一杯，他想着，喝下了第二杯，要了第三杯。

source: There is a young woman sitting not far from him who is not exactly good-looking but good-looking enough, and probably good in bed, as indeed she is.
zh_cn: 不远处坐着一位少妇，不算好看，但却足够好看。或许她床上功夫不错，其实真的不错。

source: Did he finish his beer?
zh_cn: 他喝完啤酒了吗？

source: Can't remember.
zh_cn: 记不清了。

source: What really matters is: Did he enjoy his orgasm?
zh_cn: 重要的是：他的高潮来得爽吗？

source: Or even have one?
zh_cn: 或者，他高潮了吗？

source: This he is wondering on his way home through the foggy night streets from the young woman's apartment.
zh_cn: 他思考着这个问题，从那个少妇的公寓出来，穿过夜晚雾蒙蒙的街道回家。

source: Which was full of Kewpie dolls, the sort won at carnivals, and they made a date, as he recalls, to go to one.
zh_cn: 少妇的公寓里全是丘比特娃娃，就是在狂欢节上赢得的那种。他回想起来，他和少妇相约要去参加狂欢节。

source: Where she wins another- she has a knack for it.
zh_cn: 她在狂欢节上又赢来一个丘比特娃娃——她有诀窍。

source: Whereupon they're in her apartment again, taking their clothes off, she excitedly cuddling her new doll in a bed heaped with them.
zh_cn: 然后他们又在她的公寓里，脱着衣服。她在堆满了丘比特娃娃的床上，搂抱着新赢来的那个娃娃。

source: He can't remember when he last slept, and he's no longer sure, as he staggers through the night streets, still foggy, where his own apartment is, his orgasm, if he had one, already fading from memory.
zh_cn: 他记不得上次睡觉是在什么时候。而且，他摇晃着穿过仍然雾蒙蒙的街道，不确定自己的公寓在哪里。他的高潮，如果有过的话，已经从记忆中淡去了。

source: Maybe he should take her back to the carnival, he thinks, where she wins another Kewpie doll (this is at least their second date, maybe their fourth), and this time they go for a romantic nightcap at the bar where they first met.
zh_cn: 或许他应该带她再去参加狂欢节，他想着，而她已经又赢得一个丘比特娃娃（这至少是他们的第二次约会，或许是第四次）。现在他们回到初遇那家酒吧喝杯浪漫的夜酒。

source: Where a brawny dude starts hassling her.
zh_cn: 酒吧里有个壮汉过来烦她。

source: He intervenes and she turns up at his hospital bed, bringing him one of her Kewpie dolls to keep him company.
zh_cn: 他起身阻拦，然后她出现在他的病床边，带来一个丘比特娃娃给他做伴。

source: Which is her way of expressing the bond between them, or so he supposes, as he leaves the hospital on crutches, uncertain what part of town he is in. Or what part of the year.
zh_cn: 这是她表达他们关系的方式，或者说他是这么认为的。他杵着拐杖离开医院，不知道自己在城市的哪个地方，也不知道这是一年中的哪个时候。

source: He decides that it's time to call the affair off- she's driving him crazy- but then the brawny dude turns up at their wedding and apologizes for the pounding he gave him. He didn't realize, he says, how serious they were.
zh_cn: 他觉得是时候和她一刀两断了——她快让他疯了——但是紧接着那个壮汉出现在他们的婚礼上，为打他的行为赔不是，他说，他当时没有意识到他们有多认真。

source: The guy's wedding present is a gift certificate for two free drinks at the bar where they met and a pair of white satin ribbons for his crutches.
zh_cn: 壮汉送的礼物是他们相遇那家酒吧的礼券，可以免费喝两杯，还有两条白色缎带，用来装饰他的拐杖。

source: During the ceremony, they both carry Kewpie dolls that probably have some barely hidden significance, and indeed do.
zh_cn: 婚礼进行时，他们都拿着丘比特娃娃。它们可能有着某种不言而喻的寓意，实际上它们真有。

source: The child she bears him, his or another's, reminds him, as if he needed reminding, that time is fast moving on.
zh_cn: 她为他生的那个孩子，他的或者其他人的，提醒他——似乎他需要有人提醒——时间在很快地流逝。

source: He has responsibilities now and he decides to check whether he still has the job that he had when he first met her.
zh_cn: 他现在有了责任，决定去看看他初遇她时干的那份工作是否还在。

source: He does.
zh_cn: 工作还在。

source: His absence, if he has been absent, is not remarked on, but he is not congratulated on his marriage, either, no doubt because- it comes back to him now- before he met his wife he was engaged to one of his colleagues and their co-workers had already thrown them an engagement party, so they must resent the money they spent on gifts.
zh_cn: 他的缺勤，如果他缺勤过的话，没有被人提及，但也没有人祝贺他新婚快乐，这无疑是因为——他现在想起来了——在遇到妻子之前，他已经和一位同事订了婚，而且同事也为他们举办了订婚派对，肯定也会因为花钱买了礼物而愤愤不平。

source: It's embarrassing and the atmosphere is somewhat hostile, but he has a child in kindergarten and another on the way, so what can he do?
zh_cn: 这让人很尴尬，气氛也充满了敌意，但是他有个孩子在上幼儿园，还有一个也快上幼儿园了，他能做什么呢？

source: Well, he still hasn't cashed in the gift certificate, so, for one thing, what the hell, he can go for a beer, two, in fact, and he can afford a third.
zh_cn: 噢，他还没有用那张礼券，所以他首先可以去喝杯啤酒，其实可以喝两杯，而且他还有钱喝第三杯。

source: There's a young woman sitting near him who looks like she's probably good in bed, but she's not his wife and he has no desire to commit adultery, or so he tells himself, as he sits on the edge of her bed with his pants around his ankles.
zh_cn: 附近坐着一个少妇，看少去床上功夫或许不错，但是她不是他的妻子，而他也不想和她私通，或者说他是这么告诉自己的，随后他坐在她的床边，裤子褪在脚踝上。

source: Is he taking them off or putting them on?
zh_cn: 他是在穿裤子，还是在脱裤子？

source: He's not sure, but now he pulls them on and limps home, having left his beribboned crutches somewhere.
zh_cn: 他不知道，但他把裤子拉起来，跛着回家去，把他那副装饰着缎带的拐杖落在了某个地方。

source: On arrival, he finds all the Kewpie dolls, which were put on a shelf when the babies started coming, now scattered about the apartment, beheaded and with their limbs amputated.
zh_cn: 回到家时，他发现那些在孩子出生前就收到架子上的丘比特娃娃，全都被扯掉头和腿，散落在地上。

source: One of the babies is crying, so, while he warms up a bottle of milk on the stove, he goes into its room to give it a pacifier and discovers a note from his wife pinned to its pajamas, which says that she has gone off to the hospital to have another baby and she'd better not find him here when she gets back, because if she does she'll kill him.
zh_cn: 他在炉子上热着奶瓶，有个孩子在哭，所以他到孩子的卧室给他奶嘴，发现孩子的睡衣上别着妻子写的便条。便条说她去医院生孩子，回来时最好不要看到他，不然会杀了他。

source: He believes her, so he's soon out on the streets again, wondering if he ever gave that bottle to the baby, or if it's still boiling away on the stove.
zh_cn: 他相信她，所以他很快就又沦落街头，想着奶瓶是被他给了孩子，还是还在炉子上烧着。

source: He passes the old neighborhood bar and is tempted but decides that he has had enough trouble for one lifetime and is about to walk on when he is stopped by that hulk who beat him up and who now gives him a cigar because he's just become a father and drags him into the bar for a celebratory drink, or, rather, several, he has lost count.
zh_cn: 路过那家古老的社区酒吧时，他有些心动，但是他觉得他一生的麻烦已经够多，所以打算继续往前走。这时，那个打过他的壮汉拦住他，因为自己当了父亲，所以给了他一支雪茄，然后把他拉进酒吧里喝一杯酒庆祝，或者是喝了几杯，他数不清了。

source: The celebrations are already over, however, and the new father, who has married the same woman who threw him out, is crying in his beer about the miseries of married life and congratulating him on being well out of it, a lucky man.
zh_cn: 然而庆祝结束了，那个才当了父亲、娶了把他赶出家门的女人的壮汉，喝着啤酒哭诉着婚后生活的苦楚，祝贺他逃离了苦海，说他真幸运。

source: But he doesn't feel lucky, especially when he sees a young woman sitting near them who looks like she's probably good in bed and decides to suggest that they go to her place, but too late- she's already out the door with the guy who beat him up and stole his wife.
zh_cn: 但是，他并没有觉得幸运，尤其是在他看到边上坐着一个看上去床上功夫可能不错的少妇时。他决定要提议去她的住处，但是太迟了——她已经跟着那个打过他、挖走他妻子的男人出去了。
